Repository: egeatakan/rowing
Catalog: lib/l10n/app_*.arb
Languages: it, tr

source: Main Menu
it: Menu Principale
tr: Ana Menü

source: PLAY
it: GIOCA
tr: OYNA

source: STATISTICS
it: STATISTICHE
tr: İSTATİSTİKLER

source: SETTINGS
it: IMPOSTAZIONI
tr: AYARLAR

source: EXIT
it: ESCI
tr: ÇIKIŞ

# profile
source: MY PROFILE
it: IL MIO PROFILO
tr: PROFİLİM

# welcomeMessage
source: Welcome, {userName}
it: Benvenuto, {userName}
tr: Hoş geldin, {userName}

# settingsTitle
source: Settings
it: Impostazioni
tr: Ayarlar

# statisticsTitle
source: My Statistics
it: Le Mie Statistiche
tr: İstatistiklerim

source: Language
it: Lingua
tr: Dil

source: Select Language
it: Seleziona Lingua
tr: Dil Seçin

# profileTitle
source: User Profile
it: Profilo Utente
tr: Kullanıcı Profili

source: Save
it: Salva
tr: Kaydet

source: Personal Information
it: Informazioni Personali
tr: Kişisel Bilgiler

# name
source: Your Name
it: Il Tuo Nome
tr: Adınız

# featureComingSoon
source: This feature will be added soon.
it: Questa funzione verrà aggiunta presto.
tr: Bu özellik yakında eklenecektir.

# logoutTooltip
source: Logout
it: Esci
tr: Çıkış Yap

# difficultyLevelTitle
source: Select Difficulty Level
it: Seleziona Livello Difficoltà
tr: Zorluk Seviyesini Seçin

source: Easy
it: Facile
tr: Kolay

source: Medium
it: Medio
tr: Orta

source: Hard
it: Difficile
tr: Zor

# difficultyDynamic
source: Dynamic
it: Dinamico
tr: Dinamik

# lastNMatchesPrompt
source: Average of last how many matches?
it: Media di quante ultime partite?
tr: Son kaç maçın ortalaması alınsın?

# exampleHint
source: E.g.: 3
it: Es: 3
tr: Örn: 3

# confirmAndStartButton
source: CONFIRM AND START
it: CONFERMA E INIZIA
tr: SEÇİMİ ONAYLA VE BAŞLA

# dynamicDifficultyValidationError
source: Please enter a valid positive number of matches for dynamic difficulty.
it: Inserisci un numero valido e positivo di partite per la difficoltà dinamica.
tr: Dinamik zorluk için lütfen geçerli ve pozitif bir maç sayısı girin.

# raceSettingsTitle
source: Race Settings
it: Impostazioni Gara
tr: Yarış Ayarları

# prepareForRaceTitle
source: Prepare for Race
it: Preparati per la Gara
tr: Yarışa Hazırlan

# yourStatisticsTitle
source: Your Statistics
it: Le Tue Statistiche
tr: İstatistiklerin

source: Wins
it: Vittorie
tr: Kazandın

source: Losses
it: Sconfitte
tr: Kaybettin

source: Total Races
it: Gare Totali
tr: Toplam Yarış

source: Avg. Time
it: Tempo Medio
tr: Ort. Süre

source: Best Time
it: Miglior Tempo
tr: En İyi Süre

# notAvailable
source: N/A
it: N/D
tr: Yok

# startNewRaceTitle
source: Start a New Race:
it: Inizia una Nuova Gara:
tr: Yeni Bir Yarışa Başla:

# dynamicDefaultButton
source: Dynamic (Default)
it: Dinamico (Predefinito)
tr: Dinamik (Varsayılan)

# refreshDataButton
source: Refresh Data
it: Aggiorna Dati
tr: Verileri Yenile

# nameValidationError
source: Please enter your name.
it: Per favore inserisci il tuo nome.
tr: Lütfen adınızı girin.

source: Age
it: Età
tr: Yaş

# height
source: Height (cm)
it: Altezza (cm)
tr: Boy (cm)

# weight
source: Weight (kg)
it: Peso (kg)
tr: Kilo (kg)

# pleaseEnterAge
source: Please enter your age.
it: Per favore inserisci la tua età.
tr: Lütfen yaşınızı girin.

# pleaseEnterHeight
source: Please enter your height in cm.
it: Per favore inserisci la tua altezza in cm.
tr: Lütfen boyunuzu cm cinsinden girin.

# pleaseEnterWeight
source: Please enter your weight in kg.
it: Per favore inserisci il tuo peso in kg.
tr: Lütfen kilonuzu kg cinsinden girin.

# numericValidationError
source: Please enter a valid number.
it: Per favore inserisci un numero valido.
tr: Lütfen geçerli bir sayı girin.

source: Loading race info...
it: Caricamento informazioni gara...
tr: Yarış bilgileri yükleniyor...

source: Loading difficulty settings...
it: Caricamento impostazioni difficoltà...
tr: Zorluk ayarları yükleniyor...

source: Easy Level Race Starting!
it: Inizio Gara Livello Facile!
tr: Kolay Seviyede Yarış Başlıyor!

source: Medium Level Race Starting!
it: Inizio Gara Livello Medio!
tr: Orta Seviyede Yarış Başlıyor!

source: Hard Level Race Starting!
it: Inizio Gara Livello Difficile!
tr: Zor Seviyede Yarış Başlıyor!

# dynamicDifficultyCalculating
source: Calculating Dynamic Difficulty...
it: Calcolo Difficoltà Dinamica...
tr: Dinamik Zorluk Hesaplanıyor...

# dynamicDifficultyStartMessage
source: Dynamic Difficulty (Avg. Last {matchCount} Matches)! Bot Speed: {botSpeed} m/s
it: Difficoltà Dinamica (Media Ultime {matchCount} Partite)! Velocità Bot: {botSpeed} m/s
tr: Dinamik Zorluk (Son {matchCount} Maç Ort.)! Bot Hızı: {botSpeed} m/s

# dynamicNoDataStartMedium
source: Not enough match data for dynamic difficulty, starting with Medium speed!
it: Dati partita insufficienti per difficoltà dinamica, inizio con velocità Media!
tr: Dinamik zorluk için yeterli maç verisi yok, Ortalama hızla yarış başlıyor!

# dynamicNoHistoryStartMedium
source: No match history, starting with Medium speed!
it: Nessuna cronologia partite, inizio con velocità Media!
tr: Hiç maç geçmişiniz yok, Orta seviyede yarış başlıyor!

# dynamicErrorStartMedium
source: Error reading match history, starting with Medium speed!
it: Errore lettura cronologia partite, inizio con velocità Media!
tr: Maç geçmişi okunurken hata oluştu, Orta seviyede yarış başlıyor!

# dynamicLoginNeeded
source: Not logged in, starting with Medium speed!
it: Accesso non effettuato, inizio con velocità Media!
tr: Giriş yapılmamış, Orta seviyede yarış başlıyor!

# dynamicNoMatchCount
source: Match count not specified for dynamic difficulty, starting with Medium speed!
it: Numero partite non specificato per difficoltà dinamica, inizio con velocità Media!
tr: Dinamik zorluk için maç sayısı belirtilmemiş, Orta seviyede yarış başlıyor!

# raceAppBarTitle
source: {difficultyLevel} Level Race
it: Gara Livello {difficultyLevel}
tr: {difficultyLevel} Seviye Yarış

# dynamicDifficultyAppBarTitle
source: DYNAMIC DIFFICULTY RACE
it: GARA DIFFICOLTÀ DINAMICA
tr: DİNAMİK ZORLUK YARIŞI

# statisticsTooltip
source: My Statistics
it: Le Mie Statistiche
tr: İstatistiklerim

# userLabel
source: User:
it: Utente:
tr: Kullanıcı:

# unknownUser
source: Unknown
it: Sconosciuto
tr: Bilinmiyor

# closeButton
source: Close
it: Chiudi
tr: Kapat

# racerLabel
source: Racer:
it: Corridore:
tr: Yarışçı:

# timeLabel
source: TIME:
it: TEMPO:
tr: SÜRE:

# youLabel
source: YOU
it: TU
tr: SEN

# raceFinishedMessage
source: üèÅ RACE FINISHED! üèÅ
it: 🏁 GARA TERMINATA! 🏁
tr: 🏁 YARIŞ SONUÇLANDI! 🏁

# keepRowingMessage
source: Keep Rowing!
it: Continua a Remare!
tr: Kürek Çekmeye Devam!

# botFinishedContinueMessage
source: Bot finished, keep going!
it: Il Bot ha finito, continua!
tr: Bot bitirdi, devam et!

# raceStartingSoonMessage
source: Race Starting Soon...
it: La Gara Sta per Iniziare...
tr: Yarış Başlamak Üzere...

# calculatingResultsMessage
source: Race Over, Calculating Results...
it: Gara Finita, Calcolo Risultati...
tr: Yarış Bitti, Sonuçlar Hesaplanıyor...

# winnerMessage
source: {winner} Wins!
it: {winner} Vince!
tr: {winner} Kazandı!

# yourTimeMessage
source: Your Time: {time} seconds
it: Il Tuo Tempo: {time} secondi
tr: Senin Süren: {time} saniye

# botTimeMessage
source: Bot Time: {time} seconds
it: Tempo Bot: {time} secondi
tr: Bot Süresi: {time} saniye

# botNotFinishedMessage
source: Bot hasn't finished yet
it: Il Bot non ha ancora finito
tr: Bot henüz bitirmedi

# playAgainButton
source: Play Again
it: Gioca Ancora
tr: Tekrar Oyna

# errorSavingRaceResult
source: Error saving race result: {error}
it: Errore nel salvataggio del risultato della gara: {error}
tr: Yarış sonucu kaydedilirken bir hata oluştu: {error}

# errorLoggingOut
source: Logout error: {error}
it: Errore di logout: {error}
tr: Çıkış hatası: {error}
